---
kind: type
id: T:Autodesk.Revit.DB.OrdinateTextOrientation
source: html/e8631cb4-24fc-71e8-3916-55dd5aa8ebf3.htm
---
# Autodesk.Revit.DB.OrdinateTextOrientation

The ordinate dimension text orientation.

## Syntax (C#)
```csharp
public enum OrdinateTextOrientation
```